[
  {
      "S. No.":1,
      "problem":"Damaged",
      "category":"Road Sign",
      "type":"STOP Sign",
      "data":"The 'STOP' sign, used on Minor Roads intersecting Major Roads, requires vehicles to stop before entering and proceed only when safe. It is octagonal with a red background, a white border, and \"STOP\" written centrally in white. Installed on the left side of the approach, it should be placed close to the stop line, typically 1.5 m in advance, without impairing visibility of the Major Road.\nThe dimensions vary by approach speed: up to 50 km\/h, 750 mm height, 25 mm border, 175 mm font; 51–65 km\/h, 900 mm height, 30 mm border, 210 mm font; and over 65 km\/h, 1200 mm height, 40 mm border, 280 mm font.",
      "code":"IRC:67-2022",
      "clause":"14.4",
      "content":"Problem: Damaged. Category: Road Sign. Type: STOP Sign. Data: The 'STOP' sign, used on Minor Roads intersecting Major Roads, requires vehicles to stop before entering and proceed only when safe. It is octagonal with a red background, a white border, and \"STOP\" written centrally in white. Installed on the left side of the approach, it should be placed close to the stop line, typically 1.5 m in advance, without impairing visibility of the Major Road.\nThe dimensions vary by approach speed: up to 50 km\/h, 750 mm height, 25 mm border, 175 mm font; 51–65 km\/h, 900 mm height, 30 mm border, 210 mm font; and over 65 km\/h, 1200 mm height, 40 mm border, 280 mm font.. Code: IRC:67-2022. Clause: 14.4"
  },
  {
      "S. No.":2,
      "problem":"Height Issue",
      "category":"Road Sign",
      "type":"Minimum Speed Limit Sign",
      "data":"Minimum Speed Limit Sign shall be installed to indicate the minimum legal speed. This shall be used on specific sections to avoid the slow moving vehicles acting as a hindrance so as to improve the efficiency of the traffic movement. When installing road signs, it is important to ensure proper clearance and visibility for both vehicles and pedestrians. For kerbed roads, the bottom edge of the lowest sign shall be 2.1 to 2.5 m above the kerb and shall be 2 to 2.5 m above the pavement on roads without kerbs. A minimum headroom of 2.1 m is required for signs above footpaths or pedestrian areas. For multi-lane highways, signs placed on medians for better visibility shall have a minimum clearance of 2.5 m (as per clauses 4.3, 4.4).\n*Prohibitory Signs in conjunction with traffic signal",
      "code":"IRC:67-2022",
      "clause":"14.10.6",
      "content":"Problem: Height Issue. Category: Road Sign. Type: Minimum Speed Limit Sign. Data: Minimum Speed Limit Sign shall be installed to indicate the minimum legal speed. This shall be used on specific sections to avoid the slow moving vehicles acting as a hindrance so as to improve the efficiency of the traffic movement. When installing road signs, it is important to ensure proper clearance and visibility for both vehicles and pedestrians. For kerbed roads, the bottom edge of the lowest sign shall be 2.1 to 2.5 m above the kerb and shall be 2 to 2.5 m above the pavement on roads without kerbs. A minimum headroom of 2.1 m is required for signs above footpaths or pedestrian areas. For multi-lane highways, signs placed on medians for better visibility shall have a minimum clearance of 2.5 m (as per clauses 4.3, 4.4).\n*Prohibitory Signs in conjunction with traffic signal. Code: IRC:67-2022. Clause: 14.10.6"
  },
  {
      "S. No.":3,
      "problem":"Faded",
      "category":"Road Sign",
      "type":"Hospital Sign",
      "data":"Hospital sign should be used to notify drivers of vehicles that they should take the precautions required near medical establishments and in particular that they should not make any unnecessary noise. The sign also serves to indicate the location of hospital where medical facilities will be available.\nSign shall be rectangular and have a blue background, while black symbol shall be displayed in a white square to indicate the facility. The size of the normal sign shall be 600 mm x 800 mm and of the small sized sign 450 mm x 600 mm.On the blue band at the bottom of the sign, the distance to the facility indicated or to entry of the road leading to it, may be inscribed in white. Signs may also be set up at the entry to the road leading to the facility and may then bear a white directional arrow on the blue part at the bottom (as per clause 17.1).",
      "code":"IRC:67-2022",
      "clause":"17.8",
      "content":"Problem: Faded. Category: Road Sign. Type: Hospital Sign. Data: Hospital sign should be used to notify drivers of vehicles that they should take the precautions required near medical establishments and in particular that they should not make any unnecessary noise. The sign also serves to indicate the location of hospital where medical facilities will be available.\nSign shall be rectangular and have a blue background, while black symbol shall be displayed in a white square to indicate the facility. The size of the normal sign shall be 600 mm x 800 mm and of the small sized sign 450 mm x 600 mm.On the blue band at the bottom of the sign, the distance to the facility indicated or to entry of the road leading to it, may be inscribed in white. Signs may also be set up at the entry to the road leading to the facility and may then bear a white directional arrow on the blue part at the bottom (as per clause 17.1).. Code: IRC:67-2022. Clause: 17.8"
  },
  {
      "S. No.":4,
      "problem":"Spacing Issue",
      "category":"Road Sign",
      "type":"U-Turn Ahead Sign",
      "data":"When multiple signs need to be placed along the same section of road, care shall be taken to ensure they do not obscure each other. On interurban roads, two successive signs shall be spaced at a minimum distance of 0.6*V m (where V is the design speed in km\/h). For urban roads, a minimum distance of 20 m between successive signs shall be maintained.",
      "code":"IRC:67-2022",
      "clause":"4.8",
      "content":"Problem: Spacing Issue. Category: Road Sign. Type: U-Turn Ahead Sign. Data: When multiple signs need to be placed along the same section of road, care shall be taken to ensure they do not obscure each other. On interurban roads, two successive signs shall be spaced at a minimum distance of 0.6*V m (where V is the design speed in km\/h). For urban roads, a minimum distance of 20 m between successive signs shall be maintained.. Code: IRC:67-2022. Clause: 4.8"
  },
  {
      "S. No.":5,
      "problem":"Improper Placement",
      "category":"Road Sign",
      "type":"Gap in Median Sign",
      "data":"Gap in Median sign shall be installed ahead of a gap in the median of a divided carriageway, other than at intersection.\nSigns are normally erected on the left side of the road, but in high-traffic areas, critical locations or where visibility is limited, a second sign may be placed on the right side or median of multilane roads (as per clause 4.8).\nPlacement of Cautionary sign vary with approach speed: up to 50 km\/h, clear visibility distance as 45 m placed 45m from the hazard; 51-65 km\/h, clear visibility distance as 60 m placed 45-110m from the hazard; 66-80 km\/h, clear visibility distance as 70 m placed 110-180m from the hazard; 81-120 km\/h, clear visibility distance as 90 m placed 180-245m from the hazard; 121-150 km\/h, clear visibility distance as 110 m placed 245-305m from the hazard (as per clause 15.2).\nSigns shall be 600 mm to 3 m from the shoulder, at least 1 m from the edge on roads without shoulders and minimum 300 mm from the kerb on kerbed roads, ensuring no obstruction (as per clause 4.2).",
      "code":"IRC:67-2022",
      "clause":"15.26",
      "content":"Problem: Improper Placement. Category: Road Sign. Type: Gap in Median Sign. Data: Gap in Median sign shall be installed ahead of a gap in the median of a divided carriageway, other than at intersection.\nSigns are normally erected on the left side of the road, but in high-traffic areas, critical locations or where visibility is limited, a second sign may be placed on the right side or median of multilane roads (as per clause 4.8).\nPlacement of Cautionary sign vary with approach speed: up to 50 km\/h, clear visibility distance as 45 m placed 45m from the hazard; 51-65 km\/h, clear visibility distance as 60 m placed 45-110m from the hazard; 66-80 km\/h, clear visibility distance as 70 m placed 110-180m from the hazard; 81-120 km\/h, clear visibility distance as 90 m placed 180-245m from the hazard; 121-150 km\/h, clear visibility distance as 110 m placed 245-305m from the hazard (as per clause 15.2).\nSigns shall be 600 mm to 3 m from the shoulder, at least 1 m from the edge on roads without shoulders and minimum 300 mm from the kerb on kerbed roads, ensuring no obstruction (as per clause 4.2).. Code: IRC:67-2022. Clause: 15.26"
  },
  {
      "S. No.":6,
      "problem":"Obstruction",
      "category":"Road Sign",
      "type":"Crash Prone Area Ahead Sign",
      "data":"Drivers and other road users must have a clear and unobstructed view of road signs to ensure safe navigation. The area that shall remain free from obstructions to the sight line, whether caused by vegetation (e.g., bushes, trees), other signs, or street furniture (e.g., crash barriers), is referred to as the clear visibility distance. This distance shall increase as traffic speeds rise to provide sufficient reaction time. Road signs or their supports (including front and back) shall not display any form of advertisement or message unrelated to traffic control (as per clause 2.3).",
      "code":"IRC:67-2022",
      "clause":"11.2",
      "content":"Problem: Obstruction. Category: Road Sign. Type: Crash Prone Area Ahead Sign. Data: Drivers and other road users must have a clear and unobstructed view of road signs to ensure safe navigation. The area that shall remain free from obstructions to the sight line, whether caused by vegetation (e.g., bushes, trees), other signs, or street furniture (e.g., crash barriers), is referred to as the clear visibility distance. This distance shall increase as traffic speeds rise to provide sufficient reaction time. Road signs or their supports (including front and back) shall not display any form of advertisement or message unrelated to traffic control (as per clause 2.3).. Code: IRC:67-2022. Clause: 11.2"
  },
  {
      "S. No.":7,
      "problem":"Non-Retroreflective",
      "category":"Road Sign",
      "type":"U-Turn Prohibited Sign",
      "data":"The 'U-Turn Prohibited' sign indicates areas where vehicles are not allowed to reverse their direction of travel. It should be placed at the start and at intervals along road sections where this restriction is enforced by the controlling authority. The maximum spacing between two successive signs should not exceed 120 meters on each side of the road. The sign is circular with a red border, a red oblique bar, a white background, and a black symbol. The sign is circular with a red border, a red oblique bar, a white background, and a black symbol. Its size depends on design speed: Up to 65 km\/h (300 mm* diameter, 35 mm border and oblique bar, 75 mm font; or 600 mm diameter, 50 mm border and bar, 100 mm font), 66–80 km\/h (750 mm diameter, 60 mm border and oblique bar, 125 mm font), 81–100 km\/h (900 mm diameter, 75 mm border and oblique bar, 150 mm font), 101–120 km\/h (1200 mm diameter, 100 mm border and oblique bar, 225 mm font), and 121–150 km\/h (1500 mm diameter, 125 mm border and oblique bar, 250 mm font).\nThe retro-reflective sheeting used shall cover the entire surface, be weather-resistant, colorfast, and free from defects, with a minimum coefficient of retro-reflection in accordance with ASTM D 4956 standards. The sign shall be replaced either at the end of the warranty period of the retro-reflective sheeting or if its reflectivity falls below 80 percent of the initial reflectivity (as per clauses 6.7 & 13.3).\n*Prohibitory Signs in conjunction with traffic signal",
      "code":"IRC:67-2022",
      "clause":"14.6.22",
      "content":"Problem: Non-Retroreflective. Category: Road Sign. Type: U-Turn Prohibited Sign. Data: The 'U-Turn Prohibited' sign indicates areas where vehicles are not allowed to reverse their direction of travel. It should be placed at the start and at intervals along road sections where this restriction is enforced by the controlling authority. The maximum spacing between two successive signs should not exceed 120 meters on each side of the road. The sign is circular with a red border, a red oblique bar, a white background, and a black symbol. The sign is circular with a red border, a red oblique bar, a white background, and a black symbol. Its size depends on design speed: Up to 65 km\/h (300 mm* diameter, 35 mm border and oblique bar, 75 mm font; or 600 mm diameter, 50 mm border and bar, 100 mm font), 66–80 km\/h (750 mm diameter, 60 mm border and oblique bar, 125 mm font), 81–100 km\/h (900 mm diameter, 75 mm border and oblique bar, 150 mm font), 101–120 km\/h (1200 mm diameter, 100 mm border and oblique bar, 225 mm font), and 121–150 km\/h (1500 mm diameter, 125 mm border and oblique bar, 250 mm font).\nThe retro-reflective sheeting used shall cover the entire surface, be weather-resistant, colorfast, and free from defects, with a minimum coefficient of retro-reflection in accordance with ASTM D 4956 standards. The sign shall be replaced either at the end of the warranty period of the retro-reflective sheeting or if its reflectivity falls below 80 percent of the initial reflectivity (as per clauses 6.7 & 13.3).\n*Prohibitory Signs in conjunction with traffic signal. Code: IRC:67-2022. Clause: 14.6.22"
  },
  {
      "S. No.":8,
      "problem":"Spacing Issue",
      "category":"Road Sign",
      "type":"U-Turn Ahead Sign",
      "data":"When multiple signs need to be placed along the same section of road, care shall be taken to ensure they do not obscure each other. On interurban roads, two successive signs shall be spaced at a minimum distance of 0.6*V m (where V is the design speed in km\/h). For urban roads, a minimum distance of 20 m between successive signs shall be maintained.",
      "code":"IRC:67-2022",
      "clause":"4.8",
      "content":"Problem: Spacing Issue. Category: Road Sign. Type: U-Turn Ahead Sign. Data: When multiple signs need to be placed along the same section of road, care shall be taken to ensure they do not obscure each other. On interurban roads, two successive signs shall be spaced at a minimum distance of 0.6*V m (where V is the design speed in km\/h). For urban roads, a minimum distance of 20 m between successive signs shall be maintained.. Code: IRC:67-2022. Clause: 4.8"
  },
  {
      "S. No.":9,
      "problem":"Height Issue",
      "category":"Road Sign",
      "type":"Object Hazard (Left) Sign",
      "data":"Retroreflective Object Hazard (Left) sign is used for roadside hazards on the left side, such as bridge abutments, guard rails or trees encroaching into the roadway. It is specifically intended to warn of hazards located on the left edge of the travelled way. The sign shall be a vertical rectangle of 300 mm x 900 mm.\nObject Hazard Marker are striped markers with alternating black and yellow stripes sloping downward at an angle of 45° towards the side of the obstruction on which the traffic is to pass. These shall be erected immediately ahead of the line of obstruction and at sufficient height to ensure that these will be properly visible to the oncoming traffic. The inner edge of the OHM shall align with the obstruction's inner edge wherever possible (as per clause 5.1 and 5.2 of IRC:79-2019).",
      "code":"IRC:67-2022",
      "clause":"15.66",
      "content":"Problem: Height Issue. Category: Road Sign. Type: Object Hazard (Left) Sign. Data: Retroreflective Object Hazard (Left) sign is used for roadside hazards on the left side, such as bridge abutments, guard rails or trees encroaching into the roadway. It is specifically intended to warn of hazards located on the left edge of the travelled way. The sign shall be a vertical rectangle of 300 mm x 900 mm.\nObject Hazard Marker are striped markers with alternating black and yellow stripes sloping downward at an angle of 45° towards the side of the obstruction on which the traffic is to pass. These shall be erected immediately ahead of the line of obstruction and at sufficient height to ensure that these will be properly visible to the oncoming traffic. The inner edge of the OHM shall align with the obstruction's inner edge wherever possible (as per clause 5.1 and 5.2 of IRC:79-2019).. Code: IRC:67-2022. Clause: 15.66"
  },
  {
      "S. No.":10,
      "problem":"Obstruction",
      "category":"Road Sign",
      "type":"Bus Stop Sign",
      "data":"Drivers and other road users must have a clear and unobstructed view of road signs to ensure safe navigation. The area that should remain free from obstructions to the sight line, whether caused by vegetation (e.g., bushes, trees), other signs, or street furniture (e.g., crash barriers), is referred to as the clear visibility distance. This distance should increase as traffic speeds rise to provide sufficient reaction time.\nRoad signs or their supports (including front and back) shall not display any form of advertisement or message unrelated to traffic control (as per clause 2.3).",
      "code":"IRC:67-2022",
      "clause":"11.2",
      "content":"Problem: Obstruction. Category: Road Sign. Type: Bus Stop Sign. Data: Drivers and other road users must have a clear and unobstructed view of road signs to ensure safe navigation. The area that should remain free from obstructions to the sight line, whether caused by vegetation (e.g., bushes, trees), other signs, or street furniture (e.g., crash barriers), is referred to as the clear visibility distance. This distance should increase as traffic speeds rise to provide sufficient reaction time.\nRoad signs or their supports (including front and back) shall not display any form of advertisement or message unrelated to traffic control (as per clause 2.3).. Code: IRC:67-2022. Clause: 11.2"
  },
  {
      "S. No.":11,
      "problem":"Damaged",
      "category":"Road Sign",
      "type":"Truck Lay-By Sign",
      "data":"The provision of Truck Lay-by has become necessary and as such the truck drivers must be adequately informed of the availability of such a facility. Sign need to be provided with the directional arrow showing the direction in which the facility is located. These signs are to be posted in advance at 250 m and 500 m ahead of the location where truck lay-by is provided.\nSigns may be in the shape of an elongated rectangle and colour pattern will be green background with letters in white. The size of letters depends on design speed of road which can be refered in Table 12.1. On the sign arrow showing truck lay-by direction need to be provided at 45 degree on the left side.",
      "code":"IRC:67-2022",
      "clause":"16.3.6",
      "content":"Problem: Damaged. Category: Road Sign. Type: Truck Lay-By Sign. Data: The provision of Truck Lay-by has become necessary and as such the truck drivers must be adequately informed of the availability of such a facility. Sign need to be provided with the directional arrow showing the direction in which the facility is located. These signs are to be posted in advance at 250 m and 500 m ahead of the location where truck lay-by is provided.\nSigns may be in the shape of an elongated rectangle and colour pattern will be green background with letters in white. The size of letters depends on design speed of road which can be refered in Table 12.1. On the sign arrow showing truck lay-by direction need to be provided at 45 degree on the left side.. Code: IRC:67-2022. Clause: 16.3.6"
  },
  {
      "S. No.":12,
      "problem":"Missing",
      "category":"Road Sign",
      "type":"Emergency SOS Facility Sign",
      "data":"Emergency SOS Facility sign shall be erectedat regular intervals in rural highways and in tunnel roads where emergency phones are installed to give information to the road user regarding location and availability of services in the vicinity.\nSign shall be rectangular and have a blue background, while black symbol shall be displayed in a white square to indicate the facility. The size of the normal sign shall be 600 mm x 800 mm and of the small sized sign 450 mm x 600 mm.On the blue band at the bottom of the sign, the distance to the facility indicated or to entry of the road leading to it, may be inscribed in white. Signs may also be set up at the entry to the road leading to the facility and may then bear a white directional arrow on the blue part at the bottom (as per clause 17.1).",
      "code":"IRC:67-2022",
      "clause":"17.9",
      "content":"Problem: Missing. Category: Road Sign. Type: Emergency SOS Facility Sign. Data: Emergency SOS Facility sign shall be erectedat regular intervals in rural highways and in tunnel roads where emergency phones are installed to give information to the road user regarding location and availability of services in the vicinity.\nSign shall be rectangular and have a blue background, while black symbol shall be displayed in a white square to indicate the facility. The size of the normal sign shall be 600 mm x 800 mm and of the small sized sign 450 mm x 600 mm.On the blue band at the bottom of the sign, the distance to the facility indicated or to entry of the road leading to it, may be inscribed in white. Signs may also be set up at the entry to the road leading to the facility and may then bear a white directional arrow on the blue part at the bottom (as per clause 17.1).. Code: IRC:67-2022. Clause: 17.9"
  },
  {
      "S. No.":13,
      "problem":"Non-Standard",
      "category":"Road Sign",
      "type":"Cattle Crossing Sign",
      "data":"Cattle Crossing sign shall be placed where there is a danger of farm animals or cattle crossing the road. It shall not be used simply because animals are driven along\/across the road frequently, but only where they cross regularly.\nCautionary sign is an equilateral triangle with a white background, red border, and black symbol. Its size vary with approach speed: up to 50 km\/h, 600mm side, 45mm border; 51-65 km\/h, 750mm side, 60mm border; 66-80 km\/h, 900mm side, 70mm border; 81-120 km\/h, 1200mm side, 90mm border; 121-150 km\/h, 1500mm side, 110mm border (as per clause 15.2).",
      "code":"IRC:67-2022",
      "clause":"15.57",
      "content":"Problem: Non-Standard. Category: Road Sign. Type: Cattle Crossing Sign. Data: Cattle Crossing sign shall be placed where there is a danger of farm animals or cattle crossing the road. It shall not be used simply because animals are driven along\/across the road frequently, but only where they cross regularly.\nCautionary sign is an equilateral triangle with a white background, red border, and black symbol. Its size vary with approach speed: up to 50 km\/h, 600mm side, 45mm border; 51-65 km\/h, 750mm side, 60mm border; 66-80 km\/h, 900mm side, 70mm border; 81-120 km\/h, 1200mm side, 90mm border; 121-150 km\/h, 1500mm side, 110mm border (as per clause 15.2).. Code: IRC:67-2022. Clause: 15.57"
  },
  {
      "S. No.":14,
      "problem":"Damaged",
      "category":"Road Sign",
      "type":"Axle Load Limit Sign",
      "data":"Axle Load Limit Sign shall be erected where entry is prohibited for vehicles whose axle load exceeds a particular limit. Its size depends on design speed: Up to 65 km\/h (300 mm* diameter, 35 mm border, 75 mm font; or 600 mm diameter, 50 mm border, 100 mm font), 66–80 km\/h (750 mm diameter, 60 mm border, 125 mm font), 81–100 km\/h (900 mm diameter, 75 mm border, 150 mm font), 101–120 km\/h (1200 mm diameter, 100 mm border, 225 mm font), and 121–150 km\/h (1500 mm diameter, 125 mm border, 250 mm font).\n*Prohibitory Signs in conjunction with traffic signal",
      "code":"IRC:67-2022",
      "clause":"14.8.3",
      "content":"Problem: Damaged. Category: Road Sign. Type: Axle Load Limit Sign. Data: Axle Load Limit Sign shall be erected where entry is prohibited for vehicles whose axle load exceeds a particular limit. Its size depends on design speed: Up to 65 km\/h (300 mm* diameter, 35 mm border, 75 mm font; or 600 mm diameter, 50 mm border, 100 mm font), 66–80 km\/h (750 mm diameter, 60 mm border, 125 mm font), 81–100 km\/h (900 mm diameter, 75 mm border, 150 mm font), 101–120 km\/h (1200 mm diameter, 100 mm border, 225 mm font), and 121–150 km\/h (1500 mm diameter, 125 mm border, 250 mm font).\n*Prohibitory Signs in conjunction with traffic signal. Code: IRC:67-2022. Clause: 14.8.3"
  },
  {
      "S. No.":15,
      "problem":"Wrongly Placed",
      "category":"Road Sign",
      "type":"Compulsory Turn Left Sign",
      "data":"Road signs shall be placed and operated in a consistent manner, positioned appropriately with respect to the location or situation to which they apply. Signs that are not necessary or no longer required shall be removed.",
      "code":"IRC:67-2022",
      "clause":"2.3",
      "content":"Problem: Wrongly Placed. Category: Road Sign. Type: Compulsory Turn Left Sign. Data: Road signs shall be placed and operated in a consistent manner, positioned appropriately with respect to the location or situation to which they apply. Signs that are not necessary or no longer required shall be removed.. Code: IRC:67-2022. Clause: 2.3"
  },
  {
      "S. No.":16,
      "problem":"Missing",
      "category":"Road Sign",
      "type":"Narrow Bridge Ahead Sign",
      "data":"Narrow Bridge Ahead sign shall be erected on roads in advance of bridges where the clear width between kerbs or wheel guards is less than the normal width of the carriageway.\nCautionary sign is an equilateral triangle with a white background, red border, and black symbol. Its size and placement vary with approach speed: up to 50 km\/h, 600mm side, 45mm border, clear visibility distance as 45 m placed 45m from the hazard; 51-65 km\/h, 750mm side, 60mm border, clear visibility distance as 60 m placed 45-110m from the hazard; 66-80 km\/h, 900mm side, 70mm border, clear visibility distance as 70 m placed 110-180m from the hazard; 81-120 km\/h, 1200mm side, 90mm border, clear visibility distance as 90 m placed 180-245m from the hazard; 121-150 km\/h, 1500mm side, 110mm border, clear visibility distance as 110 m placed 245-305m from the hazard (as per clause 15.2).",
      "code":"IRC:67-2022",
      "clause":"15.2",
      "content":"Problem: Missing. Category: Road Sign. Type: Narrow Bridge Ahead Sign. Data: Narrow Bridge Ahead sign shall be erected on roads in advance of bridges where the clear width between kerbs or wheel guards is less than the normal width of the carriageway.\nCautionary sign is an equilateral triangle with a white background, red border, and black symbol. Its size and placement vary with approach speed: up to 50 km\/h, 600mm side, 45mm border, clear visibility distance as 45 m placed 45m from the hazard; 51-65 km\/h, 750mm side, 60mm border, clear visibility distance as 60 m placed 45-110m from the hazard; 66-80 km\/h, 900mm side, 70mm border, clear visibility distance as 70 m placed 110-180m from the hazard; 81-120 km\/h, 1200mm side, 90mm border, clear visibility distance as 90 m placed 180-245m from the hazard; 121-150 km\/h, 1500mm side, 110mm border, clear visibility distance as 110 m placed 245-305m from the hazard (as per clause 15.2).. Code: IRC:67-2022. Clause: 15.2"
  },
  {
      "S. No.":17,
      "problem":"Wrongly Placed",
      "category":"Road Sign",
      "type":"Pedestrian Crossing Informatory Signs",
      "data":"Road signs shall be placed and operated in a consistent manner, positioned appropriately with respect to the location or situation to which they apply. Signs that are not necessary or no longer required shall be removed.",
      "code":"IRC:67-2022",
      "clause":"2.3",
      "content":"Problem: Wrongly Placed. Category: Road Sign. Type: Pedestrian Crossing Informatory Signs. Data: Road signs shall be placed and operated in a consistent manner, positioned appropriately with respect to the location or situation to which they apply. Signs that are not necessary or no longer required shall be removed.. Code: IRC:67-2022. Clause: 2.3"
  },
  {
      "S. No.":18,
      "problem":"Missing",
      "category":"Road Sign",
      "type":"Height Limit Sign",
      "data":"Height Limit Sign shall be erected in advance of an overhead structure where entry is prohibited for vehicles whose height exceeds a certain limit. Its size depends on design speed: Up to 65 km\/h (300 mm* diameter, 35 mm border, 75 mm font; or 600 mm diameter, 50 mm border and bar, 100 mm font), 66–80 km\/h (750 mm diameter, 60 mm border, 125 mm font), 81–100 km\/h (900 mm diameter, 75 mm border, 150 mm font), 101–120 km\/h (1200 mm diameter, 100 mm border, 225 mm font), and 121–150 km\/h (1500 mm diameter, 125 mm border, 250 mm font).\n*Prohibitory Signs in conjunction with traffic signal",
      "code":"IRC:67-2022",
      "clause":"14.8.4",
      "content":"Problem: Missing. Category: Road Sign. Type: Height Limit Sign. Data: Height Limit Sign shall be erected in advance of an overhead structure where entry is prohibited for vehicles whose height exceeds a certain limit. Its size depends on design speed: Up to 65 km\/h (300 mm* diameter, 35 mm border, 75 mm font; or 600 mm diameter, 50 mm border and bar, 100 mm font), 66–80 km\/h (750 mm diameter, 60 mm border, 125 mm font), 81–100 km\/h (900 mm diameter, 75 mm border, 150 mm font), 101–120 km\/h (1200 mm diameter, 100 mm border, 225 mm font), and 121–150 km\/h (1500 mm diameter, 125 mm border, 250 mm font).\n*Prohibitory Signs in conjunction with traffic signal. Code: IRC:67-2022. Clause: 14.8.4"
  },
  {
      "S. No.":19,
      "problem":"Faded",
      "category":"Road Sign",
      "type":"Single Chevron (Normal) Sign",
      "data":"Single Chevron (Normal) signs are used on curved roadways with deflection angle between 20° and 90° and for roads operating less than 100 kmph, to inform drivers about the sharpness of the curve. The sign shall be a vertical rectangle of 500 mm x 600 mm and shall be installed always on the outside of a curve, in line with and at approximately right angle to approaching traffic. Use of a single board of chevron sign for delineating a curve shall be avoided. Spacing of chevron signs shall be such that the road user always has at least two signs in view, until the change in alignment eliminates the need for the sign. The signs shall be visible far enough in advance for drivers to react to the change in alignment. ",
      "code":"IRC:67-2022",
      "clause":"15.65",
      "content":"Problem: Faded. Category: Road Sign. Type: Single Chevron (Normal) Sign. Data: Single Chevron (Normal) signs are used on curved roadways with deflection angle between 20° and 90° and for roads operating less than 100 kmph, to inform drivers about the sharpness of the curve. The sign shall be a vertical rectangle of 500 mm x 600 mm and shall be installed always on the outside of a curve, in line with and at approximately right angle to approaching traffic. Use of a single board of chevron sign for delineating a curve shall be avoided. Spacing of chevron signs shall be such that the road user always has at least two signs in view, until the change in alignment eliminates the need for the sign. The signs shall be visible far enough in advance for drivers to react to the change in alignment. . Code: IRC:67-2022. Clause: 15.65"
  },
  {
      "S. No.":20,
      "problem":"Missing",
      "category":"Road Sign",
      "type":"STOP Sign",
      "data":"The 'STOP' sign, used on Minor Roads intersecting Major Roads, requires vehicles to stop before entering and proceed only when safe. It is octagonal with a red background, a white border, and \"STOP\" written centrally in white. Installed on the left side of the approach, it should be placed close to the stop line, typically 1.5 m in advance, without impairing visibility of the Major Road.\nThe dimensions vary by approach speed: up to 50 km\/h, 750 mm height, 25 mm border, 175 mm font; 51–65 km\/h, 900 mm height, 30 mm border, 210 mm font; and over 65 km\/h, 1200 mm height, 40 mm border, 280 mm font.",
      "code":"IRC:67-2022",
      "clause":"14.4",
      "content":"Problem: Missing. Category: Road Sign. Type: STOP Sign. Data: The 'STOP' sign, used on Minor Roads intersecting Major Roads, requires vehicles to stop before entering and proceed only when safe. It is octagonal with a red background, a white border, and \"STOP\" written centrally in white. Installed on the left side of the approach, it should be placed close to the stop line, typically 1.5 m in advance, without impairing visibility of the Major Road.\nThe dimensions vary by approach speed: up to 50 km\/h, 750 mm height, 25 mm border, 175 mm font; 51–65 km\/h, 900 mm height, 30 mm border, 210 mm font; and over 65 km\/h, 1200 mm height, 40 mm border, 280 mm font.. Code: IRC:67-2022. Clause: 14.4"
  },
  {
      "S. No.":21,
      "problem":"Visibility Issue",
      "category":"Road Marking",
      "type":"Word Message TRAM & BUS ONLY Marking",
      "data":"Road markings must be clearly visible day and night, providing essential guidance, especially on unlit roads. Drivers shall detect markings at least two seconds ahead and that minimum preview distance with respect to speed is as follows: For <30 km\/h: 17 m; 30–40 km\/h: 22 m; 40–50 km\/h: 28 m; 50–65 km\/h: 36 m; 65–70 km\/h: 39 m; 70–80 km\/h: 44 m; 80–90 km\/h: 50 m; 90–100 km\/h: 56 m; 100–110 km\/h: 61 m; 110–120 km\/h: 67 m. Visibility improves with wider lines, higher mark-to-gap ratios, and increased retro-reflectivity. These factors help drivers detect the markings according to design speed of roadway.",
      "code":"IRC:35-2015",
      "clause":"2.7",
      "content":"Problem: Visibility Issue. Category: Road Marking. Type: Word Message TRAM & BUS ONLY Marking. Data: Road markings must be clearly visible day and night, providing essential guidance, especially on unlit roads. Drivers shall detect markings at least two seconds ahead and that minimum preview distance with respect to speed is as follows: For <30 km\/h: 17 m; 30–40 km\/h: 22 m; 40–50 km\/h: 28 m; 50–65 km\/h: 36 m; 65–70 km\/h: 39 m; 70–80 km\/h: 44 m; 80–90 km\/h: 50 m; 90–100 km\/h: 56 m; 100–110 km\/h: 61 m; 110–120 km\/h: 67 m. Visibility improves with wider lines, higher mark-to-gap ratios, and increased retro-reflectivity. These factors help drivers detect the markings according to design speed of roadway.. Code: IRC:35-2015. Clause: 2.7"
  },
  {
      "S. No.":22,
      "problem":"Faded",
      "category":"Road Marking",
      "type":"Box Marking",
      "data":"Box marking (BM06) is a prohibitory marking to convey that the message that no vehicle shall be stopped\/ stationed in the designated box junction area. \nBox markings at un-signalised roundabout are not allowed but it could be used on signalled controlled roundabouts (as per clause 9.10.3).\nDimension of box marking is 2 m x 2 m and yellow in colour (as per Table A.4).",
      "code":"IRC:35-2015",
      "clause":"9.1.11",
      "content":"Problem: Faded. Category: Road Marking. Type: Box Marking. Data: Box marking (BM06) is a prohibitory marking to convey that the message that no vehicle shall be stopped\/ stationed in the designated box junction area. \nBox markings at un-signalised roundabout are not allowed but it could be used on signalled controlled roundabouts (as per clause 9.10.3).\nDimension of box marking is 2 m x 2 m and yellow in colour (as per Table A.4).. Code: IRC:35-2015. Clause: 9.1.11"
  },
  {
      "S. No.":23,
      "problem":"Placement Issue",
      "category":"Road Marking",
      "type":"Direction Information SCHOOL KEEP CLEAR Marking",
      "data":"Information to guide, warn or regulate traffic may also be conveyed by inscription of word message on the road surface. The height of the word message (DM09) is 700 mm and the letters should be elongated in the direction of traffic. The message should be marked in advance, in case visibility is restricted. The direction information SCHOOL KEEP CLEAR marking shall be yellow in colour (as per Table A.6).",
      "code":"IRC:35-2015",
      "clause":"8.6",
      "content":"Problem: Placement Issue. Category: Road Marking. Type: Direction Information SCHOOL KEEP CLEAR Marking. Data: Information to guide, warn or regulate traffic may also be conveyed by inscription of word message on the road surface. The height of the word message (DM09) is 700 mm and the letters should be elongated in the direction of traffic. The message should be marked in advance, in case visibility is restricted. The direction information SCHOOL KEEP CLEAR marking shall be yellow in colour (as per Table A.6).. Code: IRC:35-2015. Clause: 8.6"
  },
  {
      "S. No.":24,
      "problem":"Non-Retro Reflective",
      "category":"Road Marking",
      "type":"Straight Arrow Marking",
      "data":"Straight arrow marking on carriageway are meant to give straight direction for driver to take mandatorily. These markings include 3.5 m length (AM01) for speeds below 50 km\/h, 5 m length (AM08) for speeds between 51-100 km\/h and 9 m length (AM08) for speeds above 100 km\/h. The markings are 500 mm in width and are white in color (as per clause 3.5 & 8.1.2).\nHighly durable thermoplastic pavement material offers better retro-reflective performance and a longer service life than ordinary road marking paint.",
      "code":"IRC:35-2015",
      "clause":"2.2",
      "content":"Problem: Non-Retro Reflective. Category: Road Marking. Type: Straight Arrow Marking. Data: Straight arrow marking on carriageway are meant to give straight direction for driver to take mandatorily. These markings include 3.5 m length (AM01) for speeds below 50 km\/h, 5 m length (AM08) for speeds between 51-100 km\/h and 9 m length (AM08) for speeds above 100 km\/h. The markings are 500 mm in width and are white in color (as per clause 3.5 & 8.1.2).\nHighly durable thermoplastic pavement material offers better retro-reflective performance and a longer service life than ordinary road marking paint.. Code: IRC:35-2015. Clause: 2.2"
  },
  {
      "S. No.":25,
      "problem":"Visibility Issue",
      "category":"Road Marking",
      "type":"Direction Information NO ENTRY Marking",
      "data":"Road markings must be clearly visible day and night, providing essential guidance, especially on unlit roads. Drivers shall detect markings at least two seconds ahead and that minimum preview distance with respect to speed is as follows: For <30 km\/h: 17 m; 30–40 km\/h: 22 m; 40–50 km\/h: 28 m; 50–65 km\/h: 36 m; 65–70 km\/h: 39 m; 70–80 km\/h: 44 m; 80–90 km\/h: 50 m; 90–100 km\/h: 56 m; 100–110 km\/h: 61 m; 110–120 km\/h: 67 m. Visibility improves with wider lines, higher mark-to-gap ratios, and increased retro-reflectivity. These factors help drivers detect the markings according to design speed of roadway.",
      "code":"IRC:35-2015",
      "clause":"2.7",
      "content":"Problem: Visibility Issue. Category: Road Marking. Type: Direction Information NO ENTRY Marking. Data: Road markings must be clearly visible day and night, providing essential guidance, especially on unlit roads. Drivers shall detect markings at least two seconds ahead and that minimum preview distance with respect to speed is as follows: For <30 km\/h: 17 m; 30–40 km\/h: 22 m; 40–50 km\/h: 28 m; 50–65 km\/h: 36 m; 65–70 km\/h: 39 m; 70–80 km\/h: 44 m; 80–90 km\/h: 50 m; 90–100 km\/h: 56 m; 100–110 km\/h: 61 m; 110–120 km\/h: 67 m. Visibility improves with wider lines, higher mark-to-gap ratios, and increased retro-reflectivity. These factors help drivers detect the markings according to design speed of roadway.. Code: IRC:35-2015. Clause: 2.7"
  },
  {
      "S. No.":26,
      "problem":"Faded",
      "category":"Road Marking",
      "type":"Chequer Block Marking",
      "data":"Chequer block marking (BM05) are painted in checkered blocks on carriageway for easy referencing such as marking for speed breaker. Speed breaker comprises of two rows of checkered markings consisting of alternate black and white bands of 500 mm width on either side of tapering. The application of thermoplastic paint for block marking is generally different from longitudinal marking. The quality of block marking with adequate visibility is of utmost importance. This marking is of 500 mm length, 500 mm breadth, 500 mm gap in between and is painted in white.",
      "code":"IRC:35-2015",
      "clause":"11.1.2",
      "content":"Problem: Faded. Category: Road Marking. Type: Chequer Block Marking. Data: Chequer block marking (BM05) are painted in checkered blocks on carriageway for easy referencing such as marking for speed breaker. Speed breaker comprises of two rows of checkered markings consisting of alternate black and white bands of 500 mm width on either side of tapering. The application of thermoplastic paint for block marking is generally different from longitudinal marking. The quality of block marking with adequate visibility is of utmost importance. This marking is of 500 mm length, 500 mm breadth, 500 mm gap in between and is painted in white.. Code: IRC:35-2015. Clause: 11.1.2"
  },
  {
      "S. No.":27,
      "problem":"Missing",
      "category":"Road Marking",
      "type":"Uni-Directional",
      "data":"Uni-directional road studs shall be used on one directional carriageway of undivided roads, one way street or slip roads. Uni-directional carriageways shall have one coloured face with the applicable colour.\nIn Two Lane Road with Paved Shoulder (width > 7 m):\nFor normal section: White-White Bidirectional at 18 m interval shall be provided for centre line and Red-White Bidirectional at 18 m interval shall be provided for Edge line.\nFor warning section: White-White Bidirectional at 9 m interval for centre line and Red-White Bi-directional at 9 m interval shall be provided.\nFor No-Overtaking Sections: Yellow-Yellow Bidirectional at 6 m interval for centre line and Red-White Bi-directional at 6 m interval for edge line shall be provided.\nRoad studs must be placed at the center of the gap, never on or beside the line segment at broken longitudinal Markings. Road studs should be 50 mm outside the shoulder edge line, on carriageway with Paved Shoulder. With No Paved Shoulder, roadstuds can be placed directly on the edge line due to space constraints. Road studs should be in the hard strip or kerb shyness width, with 50 mm setback from the median side edge line and 100 mm clearance from the raised kerb on Median Side Edge. Only 50 mm setback is required for Flushed or Depressed Medians; 100 mm clearance is not applicable. If space is insufficient, studs can be placed adjacent to or directly on the edge line. Road Studs with Anchorages is preferable for edge lines but not recommended for concrete roads. Proper installation is required to avoid pavement damage.",
      "code":"IRC:35-2015",
      "clause":"5.3",
      "content":"Problem: Missing. Category: Road Marking. Type: Uni-Directional. Data: Uni-directional road studs shall be used on one directional carriageway of undivided roads, one way street or slip roads. Uni-directional carriageways shall have one coloured face with the applicable colour.\nIn Two Lane Road with Paved Shoulder (width > 7 m):\nFor normal section: White-White Bidirectional at 18 m interval shall be provided for centre line and Red-White Bidirectional at 18 m interval shall be provided for Edge line.\nFor warning section: White-White Bidirectional at 9 m interval for centre line and Red-White Bi-directional at 9 m interval shall be provided.\nFor No-Overtaking Sections: Yellow-Yellow Bidirectional at 6 m interval for centre line and Red-White Bi-directional at 6 m interval for edge line shall be provided.\nRoad studs must be placed at the center of the gap, never on or beside the line segment at broken longitudinal Markings. Road studs should be 50 mm outside the shoulder edge line, on carriageway with Paved Shoulder. With No Paved Shoulder, roadstuds can be placed directly on the edge line due to space constraints. Road studs should be in the hard strip or kerb shyness width, with 50 mm setback from the median side edge line and 100 mm clearance from the raised kerb on Median Side Edge. Only 50 mm setback is required for Flushed or Depressed Medians; 100 mm clearance is not applicable. If space is insufficient, studs can be placed adjacent to or directly on the edge line. Road Studs with Anchorages is preferable for edge lines but not recommended for concrete roads. Proper installation is required to avoid pavement damage.. Code: IRC:35-2015. Clause: 5.3"
  },
  {
      "S. No.":28,
      "problem":"Faded",
      "category":"Road Marking",
      "type":"Broken Traffic Lane Line Marking",
      "data":"The carriageway having two or more in one direction are divided into separate lanes by traffic lane line marking for vehicles to move in proper lanes and to discourage the meandering tendency of the drivers, thereby promoting safety and ensuring maximum capacity. Traffic lane markings should be applied near pedestrian crossings, hazardous locations, congested areas, and important one-way streets, ensuring proper implementation for safety. They must only be used where adequate lane width, as per IRC standards, is available between lane lines or the edge\/center line. If sufficient width is not maintained, markings should be avoided to prevent side-swipe accidents. Broken traffic lanes can be crossed whereas continuous traffic lanes shall not be crossed and shall be white in colour. LM31 is of 15000 mm length with 3000 mm gap length and 200 mm width and shall be white in colour (as per Table A.1).",
      "code":"IRC:35-2015",
      "clause":"4.2",
      "content":"Problem: Faded. Category: Road Marking. Type: Broken Traffic Lane Line Marking. Data: The carriageway having two or more in one direction are divided into separate lanes by traffic lane line marking for vehicles to move in proper lanes and to discourage the meandering tendency of the drivers, thereby promoting safety and ensuring maximum capacity. Traffic lane markings should be applied near pedestrian crossings, hazardous locations, congested areas, and important one-way streets, ensuring proper implementation for safety. They must only be used where adequate lane width, as per IRC standards, is available between lane lines or the edge\/center line. If sufficient width is not maintained, markings should be avoided to prevent side-swipe accidents. Broken traffic lanes can be crossed whereas continuous traffic lanes shall not be crossed and shall be white in colour. LM31 is of 15000 mm length with 3000 mm gap length and 200 mm width and shall be white in colour (as per Table A.1).. Code: IRC:35-2015. Clause: 4.2"
  },
  {
      "S. No.":29,
      "problem":"Wrong Colour Selection",
      "category":"Road Marking",
      "type":"Continuous Center Line Marking",
      "data":"The continuous center line marking (as per Table A.1) shall be white in colour.",
      "code":"IRC:35-2015",
      "clause":"4.1",
      "content":"Problem: Wrong Colour Selection. Category: Road Marking. Type: Continuous Center Line Marking. Data: The continuous center line marking (as per Table A.1) shall be white in colour.. Code: IRC:35-2015. Clause: 4.1"
  },
  {
      "S. No.":30,
      "problem":"Missing",
      "category":"Road Marking",
      "type":"Objects within Carriageway",
      "data":"Obstructions within the carriageway (e.g., underpass piers, abutments) must have at least six alternate black and yellow stripes sloping 45 degrees towards traffic, each not less than 300 mm wide. The diagonal stripes shall be uniform with black and yellow stripes at an angle of 45 degrees towards traffic. If marking directly on the object is not feasible, an independent surface may be used in front of it. The total marking width must match the obstruction’s width, including the paved shoulder, and be at least 450 mm. Warning lines on the pavement should be placed before the obstruction, followed by diagonal markings. Kerbs of raised channelizing islands, central islands and medians must have 500 mm wide black and white vertical stripes for visibility.",
      "code":"IRC:35-2015",
      "clause":"14.2",
      "content":"Problem: Missing. Category: Road Marking. Type: Objects within Carriageway. Data: Obstructions within the carriageway (e.g., underpass piers, abutments) must have at least six alternate black and yellow stripes sloping 45 degrees towards traffic, each not less than 300 mm wide. The diagonal stripes shall be uniform with black and yellow stripes at an angle of 45 degrees towards traffic. If marking directly on the object is not feasible, an independent surface may be used in front of it. The total marking width must match the obstruction’s width, including the paved shoulder, and be at least 450 mm. Warning lines on the pavement should be placed before the obstruction, followed by diagonal markings. Kerbs of raised channelizing islands, central islands and medians must have 500 mm wide black and white vertical stripes for visibility.. Code: IRC:35-2015. Clause: 14.2"
  },
  {
      "S. No.":31,
      "problem":"Non-Standard",
      "category":"Road Marking",
      "type":"Straight Arrow Marking",
      "data":"Straight arrow marking on carriageway are meant to give straight direction for driver to take mandatorily. These markings include 3.5 m length (AM01) for speeds below 50 km\/h, 5 m length (AM08) for speeds between 51-100 km\/h and 9 m length (AM08) for speeds above 100 km\/h. The markings are 500 mm in width and are white in colour.",
      "code":"IRC:35-2015",
      "clause":"3.5 and 8.1.2",
      "content":"Problem: Non-Standard. Category: Road Marking. Type: Straight Arrow Marking. Data: Straight arrow marking on carriageway are meant to give straight direction for driver to take mandatorily. These markings include 3.5 m length (AM01) for speeds below 50 km\/h, 5 m length (AM08) for speeds between 51-100 km\/h and 9 m length (AM08) for speeds above 100 km\/h. The markings are 500 mm in width and are white in colour.. Code: IRC:35-2015. Clause: 3.5 and 8.1.2"
  },
  {
      "S. No.":32,
      "problem":"Missing",
      "category":"Road Marking",
      "type":"Broken Line Marking",
      "data":"The transverse marking establishes the traffic control, lest it would lead to crashes, and therefore, its compliance is vital. The road authority shall always ensure the installation of transverse marking and continued maintenance. The transverse marking shall always be accompanied with corresponding sign. Broken line marking is of 600 mm length and 300 mm spacing, with 100 mm width (TM04), 150 mm width (TM05) or 200 mm width (TM06) with white in colour. Give way line shall be TM04 (as per Table A.2).",
      "code":"IRC:35-2015",
      "clause":"3.2",
      "content":"Problem: Missing. Category: Road Marking. Type: Broken Line Marking. Data: The transverse marking establishes the traffic control, lest it would lead to crashes, and therefore, its compliance is vital. The road authority shall always ensure the installation of transverse marking and continued maintenance. The transverse marking shall always be accompanied with corresponding sign. Broken line marking is of 600 mm length and 300 mm spacing, with 100 mm width (TM04), 150 mm width (TM05) or 200 mm width (TM06) with white in colour. Give way line shall be TM04 (as per Table A.2).. Code: IRC:35-2015. Clause: 3.2"
  },
  {
      "S. No.":33,
      "problem":"Spacing Issue",
      "category":"Road Marking",
      "type":"Bi-Directional",
      "data":"Bi-directional road studs shall be used for two directional roads to delineate the centre line and edge line. Bi-directional carriageways shall have two coloured faces which can be a combination of two colours such as Red-White bi-directional road studs or same colour on two faces like white-white bi-directional road studs or Yellow-Yellow bi-directional road studs. Road studs for four lane divided road, with carriageway width greater than 7.3 m carriageway width is as follows (as per Table 5.2): \nFor normal section: yellow-yellow bidirectional at 18 m interval for centre line (desriable one), red-white bidirectional at 18 m interval for edge line (optional one) and for traffic lane line is not required.\nFor warning section: yellow-yellow bidirectional at 9 m interval for centre line (desriable one), red-white bidirectional at 9 m interval for edge line (desirable one) and for traffic lane line is not required.\nFor no overtaking section: yellow-yellow bidirectional at 6 m interval for centre line (desriable one), red-white bidirectional at 6 m interval for edge line (desirable one) and white-white bidirectional at 6 m interval for traffic lane line (optional one).\nRoad studs must be placed at the center of the gap, never on or beside the line segment at broken longitudinal Markings. Road studs should be 50 mm outside the shoulder edge line, on carriageway with Paved Shoulder. With No Paved Shoulder, roadstuds can be placed directly on the edge line due to space constraints. Road studs should be in the hard strip or kerb shyness width, with 50 mm setback from the median side edge line and 100 mm clearance from the raised kerb on Median Side Edge. Only 50 mm setback is required for Flushed or Depressed Medians; 100 mm clearance is not applicable. If space is insufficient, studs can be placed adjacent to or directly on the edge line. Road Studs with Anchorages is preferable for edge lines but not recommended for concrete roads. Proper installation is required to avoid pavement damage.",
      "code":"IRC:35-2015",
      "clause":"5.5",
      "content":"Problem: Spacing Issue. Category: Road Marking. Type: Bi-Directional. Data: Bi-directional road studs shall be used for two directional roads to delineate the centre line and edge line. Bi-directional carriageways shall have two coloured faces which can be a combination of two colours such as Red-White bi-directional road studs or same colour on two faces like white-white bi-directional road studs or Yellow-Yellow bi-directional road studs. Road studs for four lane divided road, with carriageway width greater than 7.3 m carriageway width is as follows (as per Table 5.2): \nFor normal section: yellow-yellow bidirectional at 18 m interval for centre line (desriable one), red-white bidirectional at 18 m interval for edge line (optional one) and for traffic lane line is not required.\nFor warning section: yellow-yellow bidirectional at 9 m interval for centre line (desriable one), red-white bidirectional at 9 m interval for edge line (desirable one) and for traffic lane line is not required.\nFor no overtaking section: yellow-yellow bidirectional at 6 m interval for centre line (desriable one), red-white bidirectional at 6 m interval for edge line (desirable one) and white-white bidirectional at 6 m interval for traffic lane line (optional one).\nRoad studs must be placed at the center of the gap, never on or beside the line segment at broken longitudinal Markings. Road studs should be 50 mm outside the shoulder edge line, on carriageway with Paved Shoulder. With No Paved Shoulder, roadstuds can be placed directly on the edge line due to space constraints. Road studs should be in the hard strip or kerb shyness width, with 50 mm setback from the median side edge line and 100 mm clearance from the raised kerb on Median Side Edge. Only 50 mm setback is required for Flushed or Depressed Medians; 100 mm clearance is not applicable. If space is insufficient, studs can be placed adjacent to or directly on the edge line. Road Studs with Anchorages is preferable for edge lines but not recommended for concrete roads. Proper installation is required to avoid pavement damage.. Code: IRC:35-2015. Clause: 5.5"
  },
  {
      "S. No.":34,
      "problem":"Non-Standard",
      "category":"Road Marking",
      "type":"Word Message DISABLED Marking",
      "data":"Word message DISABLED marking (FM18) for disabled ones shall be given with 700 mm width and white in colour (as per Table A.7).",
      "code":"IRC:35-2015",
      "clause":"3.7",
      "content":"Problem: Non-Standard. Category: Road Marking. Type: Word Message DISABLED Marking. Data: Word message DISABLED marking (FM18) for disabled ones shall be given with 700 mm width and white in colour (as per Table A.7).. Code: IRC:35-2015. Clause: 3.7"
  },
  {
      "S. No.":35,
      "problem":"Missing",
      "category":"Road Marking",
      "type":"Giveway Marking",
      "data":"Consists of two broken lines (600 mm segments, 300 mm gaps), each 200 mm wide, spaced 300 mm apart. Used at intersections without stop signs, signals, or police control.\nGive Way Lines must be supplemented by a hollow triangular approach marking and a roadside sign, placed 2.5–12 m from the transverse marking.\nOn two-way minor roads, the marking extends to the centerline, with a broken line for the remaining width. If needed, a continuous line can emphasize the major road’s kerb line.\nOn major roads with paved shoulders, markings align with the shoulder edge for continuity.\nRoundabouts require Give Way markings and signs at entry points.\nUse Stop Marking and Stop Sign on minor roads at its intersecting point with a major road with restricted visibility, poor alignment, or high crash rates. If visibility is obstructed due to geometry, climate, or traffic, install a Stop Marking and Stop Sign. If visibility is clear in both directions, use a Give Way Marking and Give Way Sign on the minor road. On inter-urban and rural roads, Stop Markings and Stop Signs are preferred as they are more familiar to road users than Give Way Signs and Markings (as per clause 6.3).",
      "code":"IRC:35-2015",
      "clause":"6.2",
      "content":"Problem: Missing. Category: Road Marking. Type: Giveway Marking. Data: Consists of two broken lines (600 mm segments, 300 mm gaps), each 200 mm wide, spaced 300 mm apart. Used at intersections without stop signs, signals, or police control.\nGive Way Lines must be supplemented by a hollow triangular approach marking and a roadside sign, placed 2.5–12 m from the transverse marking.\nOn two-way minor roads, the marking extends to the centerline, with a broken line for the remaining width. If needed, a continuous line can emphasize the major road’s kerb line.\nOn major roads with paved shoulders, markings align with the shoulder edge for continuity.\nRoundabouts require Give Way markings and signs at entry points.\nUse Stop Marking and Stop Sign on minor roads at its intersecting point with a major road with restricted visibility, poor alignment, or high crash rates. If visibility is obstructed due to geometry, climate, or traffic, install a Stop Marking and Stop Sign. If visibility is clear in both directions, use a Give Way Marking and Give Way Sign on the minor road. On inter-urban and rural roads, Stop Markings and Stop Signs are preferred as they are more familiar to road users than Give Way Signs and Markings (as per clause 6.3).. Code: IRC:35-2015. Clause: 6.2"
  },
  {
      "S. No.":36,
      "problem":"Placement Issue",
      "category":"Road Marking",
      "type":"Chevron Diverging Marking",
      "data":"Channelizing markings like chevron diverging marking are utilized to demarcate the neutral area at the nose of a channelizing island which can help in reducing the incidence of collision with kerb nose. They direct the exiting traffic into the proper angle for smooth movements of divergence. These markings provide for proper and safe use of deceleration lanes. The basic function is to inform the driver about the area\/lane(s) which is set aside for the exclusive use of traffic on the main highway and thus enable the driver to adequately distinguish between through traffic lanes and the deceleration lanes. The spacing of chevron markings shall be 2 m for markings for less than 10 m (HM01), 4 m for markings 10 to 22 m marking (HM02) and 6 m for markings greater than 22 m (HM03). Wdith of chevron measures at right angles to the diagonals or chevrons is 600 mm. The total length of chevron markings depends on the lateral shift undertaken by a vehicle in motion and varies with site conditions and the length should be such that to accommodate at least two or three chevrons or diagonals. The diverging chevrons must always point towards approaching traffic. The gap between chevron and boundary line shall be 100 mm to facilitate drain of surface run off. The chevron diverging marking shall be white in colour (as per Table A.3).",
      "code":"IRC:35-2015",
      "clause":"7.2",
      "content":"Problem: Placement Issue. Category: Road Marking. Type: Chevron Diverging Marking. Data: Channelizing markings like chevron diverging marking are utilized to demarcate the neutral area at the nose of a channelizing island which can help in reducing the incidence of collision with kerb nose. They direct the exiting traffic into the proper angle for smooth movements of divergence. These markings provide for proper and safe use of deceleration lanes. The basic function is to inform the driver about the area\/lane(s) which is set aside for the exclusive use of traffic on the main highway and thus enable the driver to adequately distinguish between through traffic lanes and the deceleration lanes. The spacing of chevron markings shall be 2 m for markings for less than 10 m (HM01), 4 m for markings 10 to 22 m marking (HM02) and 6 m for markings greater than 22 m (HM03). Wdith of chevron measures at right angles to the diagonals or chevrons is 600 mm. The total length of chevron markings depends on the lateral shift undertaken by a vehicle in motion and varies with site conditions and the length should be such that to accommodate at least two or three chevrons or diagonals. The diverging chevrons must always point towards approaching traffic. The gap between chevron and boundary line shall be 100 mm to facilitate drain of surface run off. The chevron diverging marking shall be white in colour (as per Table A.3).. Code: IRC:35-2015. Clause: 7.2"
  },
  {
      "S. No.":37,
      "problem":"Wrong Colour Selection",
      "category":"Road Marking",
      "type":"Ladder Hatching Marking",
      "data":"Ladder Hatching Marking shall be white (HM10\/ HM11) provided in normal section\/ warning section and yellow (HM12\/ HM13) in colour, provided in no overtaking zone (as per Table A.3).",
      "code":"IRC:35-2015",
      "clause":"7.6.3",
      "content":"Problem: Wrong Colour Selection. Category: Road Marking. Type: Ladder Hatching Marking. Data: Ladder Hatching Marking shall be white (HM10\/ HM11) provided in normal section\/ warning section and yellow (HM12\/ HM13) in colour, provided in no overtaking zone (as per Table A.3).. Code: IRC:35-2015. Clause: 7.6.3"
  },
  {
      "S. No.":38,
      "problem":"Wrong Colour Selection",
      "category":"Road Marking",
      "type":"Objects adjacent \/ near to carriageway",
      "data":"Subway piers, abutments, and culvert head walls outside the roadway must have at least six black and white stripes sloping 45 degrees towards traffic. Electrical poles near the carriageway should have horizontal black and white stripes up to 1.25 m high, with each stripe at least 100 mm wide. guard rails, guard stones or drums and trees that are not likely to be hit unless a vehicle runs off the carriageway shall be painted solid white. Trees must be marked up to 1.25 m height, with a 300 mm black band in the middle for visibility. All objects within 2.4 m of the shoulder or kerb must be painted. Object markers, at least 1.2 m high, should be placed in front of such objects to improve visibility. Kerbs of all islands in traffic flow must have 500 mm wide vertical black and white stripes.",
      "code":"IRC:35-2015",
      "clause":"14.3",
      "content":"Problem: Wrong Colour Selection. Category: Road Marking. Type: Objects adjacent \/ near to carriageway. Data: Subway piers, abutments, and culvert head walls outside the roadway must have at least six black and white stripes sloping 45 degrees towards traffic. Electrical poles near the carriageway should have horizontal black and white stripes up to 1.25 m high, with each stripe at least 100 mm wide. guard rails, guard stones or drums and trees that are not likely to be hit unless a vehicle runs off the carriageway shall be painted solid white. Trees must be marked up to 1.25 m height, with a 300 mm black band in the middle for visibility. All objects within 2.4 m of the shoulder or kerb must be painted. Object markers, at least 1.2 m high, should be placed in front of such objects to improve visibility. Kerbs of all islands in traffic flow must have 500 mm wide vertical black and white stripes.. Code: IRC:35-2015. Clause: 14.3"
  },
  {
      "S. No.":39,
      "problem":"Damaged",
      "category":"Road Marking",
      "type":"Bi-Directional",
      "data":"Bi-directional road studs shall be used for two directional roads to delineate the centre line and edge line. Bi-directional carriageways shall have two coloured faces which can be a combination of two colours such as Red-White bi-directional road studs or same colour on two faces like white-white bi-directional road studs or Yellow-Yellow bi-directional road studs. Road studs for four lane divided road, with carriageway width greater than 7.3 m carriageway width is as follows (as per Table 5.2): \nFor normal section: yellow-yellow bidirectional at 18 m interval for centre line (desriable one), red-white bidirectional at 18 m interval for edge line (optional one) and for traffic lane line is not required.\nFor warning section: yellow-yellow bidirectional at 9 m interval for centre line (desriable one), red-white bidirectional at 9 m interval for edge line (desirable one) and for traffic lane line is not required.\nFor no overtaking section: yellow-yellow bidirectional at 6 m interval for centre line (desriable one), red-white bidirectional at 6 m interval for edge line (desirable one) and white-white bidirectional at 6 m interval for traffic lane line (optional one).\nFor divided road, in warning section: white-white bidirectional at 9 m interval (optional one) for traffic lane line shall be given.\nRoad studs must be placed at the center of the gap, never on or beside the line segment at broken longitudinal Markings. Road studs should be 50 mm outside the shoulder edge line, on carriageway with Paved Shoulder. With No Paved Shoulder, roadstuds can be placed directly on the edge line due to space constraints. Road studs should be in the hard strip or kerb shyness width, with 50 mm setback from the median side edge line and 100 mm clearance from the raised kerb on Median Side Edge. Only 50 mm setback is required for Flushed or Depressed Medians; 100 mm clearance is not applicable. If space is insufficient, studs can be placed adjacent to or directly on the edge line. Road Studs with Anchorages is preferable for edge lines but not recommended for concrete roads. Proper installation is required to avoid pavement damage.",
      "code":"IRC:35-2015",
      "clause":"5.3",
      "content":"Problem: Damaged. Category: Road Marking. Type: Bi-Directional. Data: Bi-directional road studs shall be used for two directional roads to delineate the centre line and edge line. Bi-directional carriageways shall have two coloured faces which can be a combination of two colours such as Red-White bi-directional road studs or same colour on two faces like white-white bi-directional road studs or Yellow-Yellow bi-directional road studs. Road studs for four lane divided road, with carriageway width greater than 7.3 m carriageway width is as follows (as per Table 5.2): \nFor normal section: yellow-yellow bidirectional at 18 m interval for centre line (desriable one), red-white bidirectional at 18 m interval for edge line (optional one) and for traffic lane line is not required.\nFor warning section: yellow-yellow bidirectional at 9 m interval for centre line (desriable one), red-white bidirectional at 9 m interval for edge line (desirable one) and for traffic lane line is not required.\nFor no overtaking section: yellow-yellow bidirectional at 6 m interval for centre line (desriable one), red-white bidirectional at 6 m interval for edge line (desirable one) and white-white bidirectional at 6 m interval for traffic lane line (optional one).\nFor divided road, in warning section: white-white bidirectional at 9 m interval (optional one) for traffic lane line shall be given.\nRoad studs must be placed at the center of the gap, never on or beside the line segment at broken longitudinal Markings. Road studs should be 50 mm outside the shoulder edge line, on carriageway with Paved Shoulder. With No Paved Shoulder, roadstuds can be placed directly on the edge line due to space constraints. Road studs should be in the hard strip or kerb shyness width, with 50 mm setback from the median side edge line and 100 mm clearance from the raised kerb on Median Side Edge. Only 50 mm setback is required for Flushed or Depressed Medians; 100 mm clearance is not applicable. If space is insufficient, studs can be placed adjacent to or directly on the edge line. Road Studs with Anchorages is preferable for edge lines but not recommended for concrete roads. Proper installation is required to avoid pavement damage.. Code: IRC:35-2015. Clause: 5.3"
  },
  {
      "S. No.":40,
      "problem":"Placement Issue",
      "category":"Road Marking",
      "type":"Broken Traffic Lane Line Marking",
      "data":"The carriageway having two or more in one direction are divided into separate lanes by traffic lane line marking for vehicles to move in proper lanes and to discourage the meandering tendency of the drivers, thereby promoting safety and ensuring maximum capacity. Traffic lane markings should be applied near pedestrian crossings, hazardous locations, congested areas, and important one-way streets, ensuring proper implementation for safety. They must only be used where adequate lane width, as per IRC standards, is available between lane lines or the edge\/center line. If sufficient width is not maintained, markings should be avoided to prevent side-swipe accidents. Broken traffic lanes can be crossed whereas continuous traffic lanes shall not be crossed and shall be white in colour. LM31 is of 15000 mm length with 3000 mm gap length and 200 mm width and shall be white in colour (as per Table A.1).",
      "code":"IRC:35-2015",
      "clause":"4.2",
      "content":"Problem: Placement Issue. Category: Road Marking. Type: Broken Traffic Lane Line Marking. Data: The carriageway having two or more in one direction are divided into separate lanes by traffic lane line marking for vehicles to move in proper lanes and to discourage the meandering tendency of the drivers, thereby promoting safety and ensuring maximum capacity. Traffic lane markings should be applied near pedestrian crossings, hazardous locations, congested areas, and important one-way streets, ensuring proper implementation for safety. They must only be used where adequate lane width, as per IRC standards, is available between lane lines or the edge\/center line. If sufficient width is not maintained, markings should be avoided to prevent side-swipe accidents. Broken traffic lanes can be crossed whereas continuous traffic lanes shall not be crossed and shall be white in colour. LM31 is of 15000 mm length with 3000 mm gap length and 200 mm width and shall be white in colour (as per Table A.1).. Code: IRC:35-2015. Clause: 4.2"
  },
  {
      "S. No.":41,
      "problem":"Damaged",
      "category":"Traffic Calming Measures",
      "type":"Rumble Strip",
      "data":"Rumble strips are provided at places where speed control is unavoidable in highways and arterial roads. The rumble strip can be cast in situ with cement concrete or premix bituminous materials. Rumble strip may be provided across the entire width of carriageway and paved shoulders (if any). Raised section should be 20 to 30 mm high, 200-300 mm wide and spaced about one meter centre to centre of roughly 6 numbers at one location. In accident prone locations, where accidents have occurred due to departure of vehicles from shoulder on to side slope of embankment, rumble strip can be used on such a shoulder side also.\nRumble strips shall be provided 10-20 m before zebra crossing on Arterial Roads, Collector Roads and High Pedestrian Activity Zones (as per clause 3.9).",
      "code":"IRC:99-2018",
      "clause":"2.3.3.3",
      "content":"Problem: Damaged. Category: Traffic Calming Measures. Type: Rumble Strip. Data: Rumble strips are provided at places where speed control is unavoidable in highways and arterial roads. The rumble strip can be cast in situ with cement concrete or premix bituminous materials. Rumble strip may be provided across the entire width of carriageway and paved shoulders (if any). Raised section should be 20 to 30 mm high, 200-300 mm wide and spaced about one meter centre to centre of roughly 6 numbers at one location. In accident prone locations, where accidents have occurred due to departure of vehicles from shoulder on to side slope of embankment, rumble strip can be used on such a shoulder side also.\nRumble strips shall be provided 10-20 m before zebra crossing on Arterial Roads, Collector Roads and High Pedestrian Activity Zones (as per clause 3.9).. Code: IRC:99-2018. Clause: 2.3.3.3"
  },
  {
      "S. No.":42,
      "problem":"Non-Standard",
      "category":"Traffic Calming Measures",
      "type":"Speed Bump",
      "data":"Speed bumps are precast which is fixed on the road as a traffic calming measure. But in high speed environment, these bumps prove to be traffic hazard. Once the bumps get damaged by repeated striking of traffic movement, the nail remains on the pavement and prove to be damaging the tyres of vehicle. Therefore, its usage is recommended for local and collector streets.",
      "code":"IRC:99-2018",
      "clause":"3.1.2",
      "content":"Problem: Non-Standard. Category: Traffic Calming Measures. Type: Speed Bump. Data: Speed bumps are precast which is fixed on the road as a traffic calming measure. But in high speed environment, these bumps prove to be traffic hazard. Once the bumps get damaged by repeated striking of traffic movement, the nail remains on the pavement and prove to be damaging the tyres of vehicle. Therefore, its usage is recommended for local and collector streets.. Code: IRC:99-2018. Clause: 3.1.2"
  },
  {
      "S. No.":43,
      "problem":"Missing",
      "category":"Traffic Calming Measures",
      "type":"Transverse Bar Marking",
      "data":"Transverse bar marking made of thermoplastic markings is another treatment to alert and to reduce the speed. Each set comprises of 6 bars, 200 to 300 mm wide 600 mm apart of 5 mm high and of 300 mm wide 1000 mm apart of 15 mm high. Number of sets of transverse bar markings on approach to hazardous location depending upon the speed.\nFor an approach speed of up to 50 km\/h, 1 set of bar markings (TM08) is required, with a distance of d1 = 50 meters from the hazard. For speeds between 51 and 65 km\/h, 2 sets are needed, with distances d1 = 50 meters and d2 = 80 meters. For speeds between 66 and 80 km\/h, 3 sets are required, with distances d1 = 50 meters, d2 = 80 meters, and d3 = 120 meters. For speeds between 81 and 100 km\/h, 4 sets are needed, with distances d1 = 50 meters, d2 = 80 meters, d3 = 120 meters, and d4 = 180 meters (as per clause 3.7).",
      "code":"IRC:99-2018",
      "clause":"2.3.3.4",
      "content":"Problem: Missing. Category: Traffic Calming Measures. Type: Transverse Bar Marking. Data: Transverse bar marking made of thermoplastic markings is another treatment to alert and to reduce the speed. Each set comprises of 6 bars, 200 to 300 mm wide 600 mm apart of 5 mm high and of 300 mm wide 1000 mm apart of 15 mm high. Number of sets of transverse bar markings on approach to hazardous location depending upon the speed.\nFor an approach speed of up to 50 km\/h, 1 set of bar markings (TM08) is required, with a distance of d1 = 50 meters from the hazard. For speeds between 51 and 65 km\/h, 2 sets are needed, with distances d1 = 50 meters and d2 = 80 meters. For speeds between 66 and 80 km\/h, 3 sets are required, with distances d1 = 50 meters, d2 = 80 meters, and d3 = 120 meters. For speeds between 81 and 100 km\/h, 4 sets are needed, with distances d1 = 50 meters, d2 = 80 meters, d3 = 120 meters, and d4 = 180 meters (as per clause 3.7).. Code: IRC:99-2018. Clause: 2.3.3.4"
  },
  {
      "S. No.":44,
      "problem":"Placement Issue",
      "category":"Traffic Calming Measures",
      "type":"Transverse Bar Marking",
      "data":"Transverse bar marking made of thermoplastic markings is another treatment to alert and to reduce the speed. Each set comprises of 6 bars, 200 to 300 mm wide 600 mm apart of 5 mm high and of 300 mm wide 1000 mm apart of 15 mm high. Number of sets of transverse bar markings on approach to hazardous location depending upon the speed (as per clause 2.3.3.4).\nFor an approach speed of up to 50 km\/h, 1 set of bar markings (TM08) is required, with a distance of d1 = 50 meters from the hazard. For speeds between 51 and 65 km\/h, 2 sets are needed, with distances d1 = 50 meters and d2 = 80 meters. For speeds between 66 and 80 km\/h, 3 sets are required, with distances d1 = 50 meters, d2 = 80 meters, and d3 = 120 meters. For speeds between 81 and 100 km\/h, 4 sets are needed, with distances d1 = 50 meters, d2 = 80 meters, d3 = 120 meters, and d4 = 180 meters.\n",
      "code":"IRC:99-2018",
      "clause":"3.7",
      "content":"Problem: Placement Issue. Category: Traffic Calming Measures. Type: Transverse Bar Marking. Data: Transverse bar marking made of thermoplastic markings is another treatment to alert and to reduce the speed. Each set comprises of 6 bars, 200 to 300 mm wide 600 mm apart of 5 mm high and of 300 mm wide 1000 mm apart of 15 mm high. Number of sets of transverse bar markings on approach to hazardous location depending upon the speed (as per clause 2.3.3.4).\nFor an approach speed of up to 50 km\/h, 1 set of bar markings (TM08) is required, with a distance of d1 = 50 meters from the hazard. For speeds between 51 and 65 km\/h, 2 sets are needed, with distances d1 = 50 meters and d2 = 80 meters. For speeds between 66 and 80 km\/h, 3 sets are required, with distances d1 = 50 meters, d2 = 80 meters, and d3 = 120 meters. For speeds between 81 and 100 km\/h, 4 sets are needed, with distances d1 = 50 meters, d2 = 80 meters, d3 = 120 meters, and d4 = 180 meters.\n. Code: IRC:99-2018. Clause: 3.7"
  },
  {
      "S. No.":45,
      "problem":"Non-Standard",
      "category":"Traffic Calming Measures",
      "type":"Speed Hump",
      "data":"The profile of circular shaped hump is based on the shape of a circular arc with a radius varying from 11 m to 113 m and a chord length varying from 3.0 m to 9.5 m to achieve desired speed of 20 km\/h to 50 km\/h. Circular shaped humps with rises less than assumed 10 cm will result in higher speeds than those mentioned. Rises that are higher than 10 cm may cause damage to vehicles.\nAt 20 km\/h, the radius is 11 m, the chord length is 3.0 m, and the bus speed during passage is 5 km\/h;at 25 km\/h, the radius is 15 m, the chord length is 3.5 m, and the bus speed during passage is 10 km\/h;at 30 km\/h, the radius is 20 m, the chord length is 4.0 m, and the bus speed during passage is 15 km\/h;at 35 km\/h, the radius is 31 m, the chord length is 5.0 m, and the bus speed during passage is 20 km\/h;at 40 km\/h, the radius is 53 m, the chord length is 6.5 m, and the bus speed during passage is 25 km\/h;at 45 km\/h, the radius is 80 m, the chord length is 8.0 m, and the bus speed during passage is 30 km\/h;at 50 km\/h, the radius is 113 m, the chord length is 9.5 m, and the bus speed during passage is 35 km\/h.\nSpeed breaker is provided on through road where alignment is straight like service road and other roads below grade separated structures and at side road where traffic has to stop and then proceed (as per clause 9.3.11 of IRC:SP:84-2019).\nRelatively insignificant minor road approaches shall be provided with a speed breaker at 5 m to 6 m away from STOP line (as per clause 9.2.11 of IRC:SP:84-2019).\n",
      "code":"IRC:99-2018",
      "clause":"3.1.1.1",
      "content":"Problem: Non-Standard. Category: Traffic Calming Measures. Type: Speed Hump. Data: The profile of circular shaped hump is based on the shape of a circular arc with a radius varying from 11 m to 113 m and a chord length varying from 3.0 m to 9.5 m to achieve desired speed of 20 km\/h to 50 km\/h. Circular shaped humps with rises less than assumed 10 cm will result in higher speeds than those mentioned. Rises that are higher than 10 cm may cause damage to vehicles.\nAt 20 km\/h, the radius is 11 m, the chord length is 3.0 m, and the bus speed during passage is 5 km\/h;at 25 km\/h, the radius is 15 m, the chord length is 3.5 m, and the bus speed during passage is 10 km\/h;at 30 km\/h, the radius is 20 m, the chord length is 4.0 m, and the bus speed during passage is 15 km\/h;at 35 km\/h, the radius is 31 m, the chord length is 5.0 m, and the bus speed during passage is 20 km\/h;at 40 km\/h, the radius is 53 m, the chord length is 6.5 m, and the bus speed during passage is 25 km\/h;at 45 km\/h, the radius is 80 m, the chord length is 8.0 m, and the bus speed during passage is 30 km\/h;at 50 km\/h, the radius is 113 m, the chord length is 9.5 m, and the bus speed during passage is 35 km\/h.\nSpeed breaker is provided on through road where alignment is straight like service road and other roads below grade separated structures and at side road where traffic has to stop and then proceed (as per clause 9.3.11 of IRC:SP:84-2019).\nRelatively insignificant minor road approaches shall be provided with a speed breaker at 5 m to 6 m away from STOP line (as per clause 9.2.11 of IRC:SP:84-2019).\n. Code: IRC:99-2018. Clause: 3.1.1.1"
  },
  {
      "S. No.":46,
      "problem":"Placement Issue",
      "category":"Traffic Calming Measures",
      "type":"Speed Hump",
      "data":"The profile of circular shaped hump is based on the shape of a circular arc with a radius varying from 11 m to 113 m and a chord length varying from 3.0 m to 9.5 m to achieve desired speed of 20 km\/h to 50 km\/h. Circular shaped humps with rises less than assumed 10 cm will result in higher speeds than those mentioned. Rises that are higher than 10 cm may cause damage to vehicles.At 20 km\/h, the radius is 11 m, the chord length is 3.0 m, and the bus speed during passage is 5 km\/h;at 25 km\/h, the radius is 15 m, the chord length is 3.5 m, and the bus speed during passage is 10 km\/h;at 30 km\/h, the radius is 20 m, the chord length is 4.0 m, and the bus speed during passage is 15 km\/h;at 35 km\/h, the radius is 31 m, the chord length is 5.0 m, and the bus speed during passage is 20 km\/h;at 40 km\/h, the radius is 53 m, the chord length is 6.5 m, and the bus speed during passage is 25 km\/h;at 45 km\/h, the radius is 80 m, the chord length is 8.0 m, and the bus speed during passage is 30 km\/h;at 50 km\/h, the radius is 113 m, the chord length is 9.5 m, and the bus speed during passage is 35 km\/h (as per clause 3.1.1.1 of IRC:99-2018).\nSpeed breaker on through road where alignment is straight like service road and other roads below grade separated structures shall be 5.5 m away from the junction point.\nRelatively insignificant minor road approaches shall be provided with a speed breaker at 5 m to 6 m away from STOP line.",
      "code":"IRC:SP:84-2019",
      "clause":"9.3.11 and 9.2.11",
      "content":"Problem: Placement Issue. Category: Traffic Calming Measures. Type: Speed Hump. Data: The profile of circular shaped hump is based on the shape of a circular arc with a radius varying from 11 m to 113 m and a chord length varying from 3.0 m to 9.5 m to achieve desired speed of 20 km\/h to 50 km\/h. Circular shaped humps with rises less than assumed 10 cm will result in higher speeds than those mentioned. Rises that are higher than 10 cm may cause damage to vehicles.At 20 km\/h, the radius is 11 m, the chord length is 3.0 m, and the bus speed during passage is 5 km\/h;at 25 km\/h, the radius is 15 m, the chord length is 3.5 m, and the bus speed during passage is 10 km\/h;at 30 km\/h, the radius is 20 m, the chord length is 4.0 m, and the bus speed during passage is 15 km\/h;at 35 km\/h, the radius is 31 m, the chord length is 5.0 m, and the bus speed during passage is 20 km\/h;at 40 km\/h, the radius is 53 m, the chord length is 6.5 m, and the bus speed during passage is 25 km\/h;at 45 km\/h, the radius is 80 m, the chord length is 8.0 m, and the bus speed during passage is 30 km\/h;at 50 km\/h, the radius is 113 m, the chord length is 9.5 m, and the bus speed during passage is 35 km\/h (as per clause 3.1.1.1 of IRC:99-2018).\nSpeed breaker on through road where alignment is straight like service road and other roads below grade separated structures shall be 5.5 m away from the junction point.\nRelatively insignificant minor road approaches shall be provided with a speed breaker at 5 m to 6 m away from STOP line.. Code: IRC:SP:84-2019. Clause: 9.3.11 and 9.2.11"
  },
  {
      "S. No.":47,
      "problem":"Damaged",
      "category":"Traffic Calming Measures",
      "type":"Trapezoidal Hump",
      "data":"A hump, which constitutes a 50 to 100 mm raised, flat section of a carriageway with ramps on both sides is called a trapezoidal hump. At a speed of 20 km\/h, the distance is 0.7 meters with a 14.0% decrease. At 25 km\/h, it increases to 0.8 meters, with a 12.5% reduction, and at 30 km\/h, the distance is 1.0 meter, reflecting a 10.0% decrease. At 35 km\/h, the distance reaches 1.3 meters with a 7.5% decrease, while at 40 km\/h, it grows to 1.7 meters with a 6.0% reduction. At 45 km\/h, the distance is 2.0 meters with a 5.0% decrease, and at 50 km\/h, it reaches 2.5 meters, with a 4.0% reduction.\nSpeed breaker on through road where alignment is straight like service road and other roads below grade separated structures shall be 5.5 m away from the junction point (as per clause 9.3.11 of IRC:SP:87-2019).\nRelatively insignificant minor road approaches shall be provided with a speed breaker at 5 m to 6 m away from STOP line (as per clause 9.2.11 of IRC:SP:87-2019).",
      "code":"IRC:99-2018",
      "clause":"3.1.1.2",
      "content":"Problem: Damaged. Category: Traffic Calming Measures. Type: Trapezoidal Hump. Data: A hump, which constitutes a 50 to 100 mm raised, flat section of a carriageway with ramps on both sides is called a trapezoidal hump. At a speed of 20 km\/h, the distance is 0.7 meters with a 14.0% decrease. At 25 km\/h, it increases to 0.8 meters, with a 12.5% reduction, and at 30 km\/h, the distance is 1.0 meter, reflecting a 10.0% decrease. At 35 km\/h, the distance reaches 1.3 meters with a 7.5% decrease, while at 40 km\/h, it grows to 1.7 meters with a 6.0% reduction. At 45 km\/h, the distance is 2.0 meters with a 5.0% decrease, and at 50 km\/h, it reaches 2.5 meters, with a 4.0% reduction.\nSpeed breaker on through road where alignment is straight like service road and other roads below grade separated structures shall be 5.5 m away from the junction point (as per clause 9.3.11 of IRC:SP:87-2019).\nRelatively insignificant minor road approaches shall be provided with a speed breaker at 5 m to 6 m away from STOP line (as per clause 9.2.11 of IRC:SP:87-2019).. Code: IRC:99-2018. Clause: 3.1.1.2"
  },
  {
      "S. No.":48,
      "problem":"Missing",
      "category":"Traffic Calming Measures",
      "type":"Rumble Strip",
      "data":"Rumble strips are provided at places where speed control is unavoidable in highways and arterial roads. The rumble strip can be cast in situ with cement concrete or premix bituminous materials. Rumble strip may be provided across the entire width of carriageway and paved shoulders (if any). Raised section should be 20 to 30 mm high, 200-300 mm wide and spaced about one meter centre to centre of roughly 6 numbers at one location. In accident prone locations, where accidents have occurred due to departure of vehicles from shoulder on to side slope of embankment, rumble strip can be used on such a shoulder side also.\nRumble strips shall be provided 10-20 m before zebra crossing on Arterial Roads, Collector Roads and High Pedestrian Activity Zones (as per clause 3.9).",
      "code":"IRC:99-2018",
      "clause":"2.3.3.3",
      "content":"Problem: Missing. Category: Traffic Calming Measures. Type: Rumble Strip. Data: Rumble strips are provided at places where speed control is unavoidable in highways and arterial roads. The rumble strip can be cast in situ with cement concrete or premix bituminous materials. Rumble strip may be provided across the entire width of carriageway and paved shoulders (if any). Raised section should be 20 to 30 mm high, 200-300 mm wide and spaced about one meter centre to centre of roughly 6 numbers at one location. In accident prone locations, where accidents have occurred due to departure of vehicles from shoulder on to side slope of embankment, rumble strip can be used on such a shoulder side also.\nRumble strips shall be provided 10-20 m before zebra crossing on Arterial Roads, Collector Roads and High Pedestrian Activity Zones (as per clause 3.9).. Code: IRC:99-2018. Clause: 2.3.3.3"
  },
  {
      "S. No.":49,
      "problem":"Faded",
      "category":"Traffic Calming Measures",
      "type":"Transverse Bar Marking",
      "data":"Transverse bar marking made of thermoplastic markings is another treatment to alert and to reduce the speed. Each set comprises of 6 bars, 200 to 300 mm wide 600 mm apart of 5 mm high and of 300 mm wide 1000 mm apart of 15 mm high. Number of sets of transverse bar markings on approach to hazardous location depending upon the speed.\nFor an approach speed of up to 50 km\/h, 1 set of bar markings (TM08) is required, with a distance of d1 = 50 meters from the hazard. For speeds between 51 and 65 km\/h, 2 sets are needed, with distances d1 = 50 meters and d2 = 80 meters. For speeds between 66 and 80 km\/h, 3 sets are required, with distances d1 = 50 meters, d2 = 80 meters, and d3 = 120 meters. For speeds between 81 and 100 km\/h, 4 sets are needed, with distances d1 = 50 meters, d2 = 80 meters, d3 = 120 meters, and d4 = 180 meters (as per clause 3.7).",
      "code":"IRC:99-2018",
      "clause":"2.3.3.4",
      "content":"Problem: Faded. Category: Traffic Calming Measures. Type: Transverse Bar Marking. Data: Transverse bar marking made of thermoplastic markings is another treatment to alert and to reduce the speed. Each set comprises of 6 bars, 200 to 300 mm wide 600 mm apart of 5 mm high and of 300 mm wide 1000 mm apart of 15 mm high. Number of sets of transverse bar markings on approach to hazardous location depending upon the speed.\nFor an approach speed of up to 50 km\/h, 1 set of bar markings (TM08) is required, with a distance of d1 = 50 meters from the hazard. For speeds between 51 and 65 km\/h, 2 sets are needed, with distances d1 = 50 meters and d2 = 80 meters. For speeds between 66 and 80 km\/h, 3 sets are required, with distances d1 = 50 meters, d2 = 80 meters, and d3 = 120 meters. For speeds between 81 and 100 km\/h, 4 sets are needed, with distances d1 = 50 meters, d2 = 80 meters, d3 = 120 meters, and d4 = 180 meters (as per clause 3.7).. Code: IRC:99-2018. Clause: 2.3.3.4"
  },
  {
      "S. No.":50,
      "problem":"Missing",
      "category":"Traffic Calming Measures",
      "type":"Speed Hump",
      "data":"The profile of circular shaped hump is based on the shape of a circular arc with a radius varying from 11 m to 113 m and a chord length varying from 3.0 m to 9.5 m to achieve desired speed of 20 km\/h to 50 km\/h. Circular shaped humps with rises less than assumed 10 cm will result in higher speeds than those mentioned. Rises that are higher than 10 cm may cause damage to vehicles.\nAt 20 km\/h, the radius is 11 m, the chord length is 3.0 m, and the bus speed during passage is 5 km\/h;at 25 km\/h, the radius is 15 m, the chord length is 3.5 m, and the bus speed during passage is 10 km\/h;at 30 km\/h, the radius is 20 m, the chord length is 4.0 m, and the bus speed during passage is 15 km\/h;at 35 km\/h, the radius is 31 m, the chord length is 5.0 m, and the bus speed during passage is 20 km\/h;at 40 km\/h, the radius is 53 m, the chord length is 6.5 m, and the bus speed during passage is 25 km\/h;at 45 km\/h, the radius is 80 m, the chord length is 8.0 m, and the bus speed during passage is 30 km\/h;at 50 km\/h, the radius is 113 m, the chord length is 9.5 m, and the bus speed during passage is 35 km\/h.\nRelatively insignificant minor road approaches shall be provided with a speed breaker at 8 m to 12 m away from edge line (as per clause 9.2.11 of IRC:SP:73-2018).",
      "code":"IRC:99-2018",
      "clause":"3.1.1.1",
      "content":"Problem: Missing. Category: Traffic Calming Measures. Type: Speed Hump. Data: The profile of circular shaped hump is based on the shape of a circular arc with a radius varying from 11 m to 113 m and a chord length varying from 3.0 m to 9.5 m to achieve desired speed of 20 km\/h to 50 km\/h. Circular shaped humps with rises less than assumed 10 cm will result in higher speeds than those mentioned. Rises that are higher than 10 cm may cause damage to vehicles.\nAt 20 km\/h, the radius is 11 m, the chord length is 3.0 m, and the bus speed during passage is 5 km\/h;at 25 km\/h, the radius is 15 m, the chord length is 3.5 m, and the bus speed during passage is 10 km\/h;at 30 km\/h, the radius is 20 m, the chord length is 4.0 m, and the bus speed during passage is 15 km\/h;at 35 km\/h, the radius is 31 m, the chord length is 5.0 m, and the bus speed during passage is 20 km\/h;at 40 km\/h, the radius is 53 m, the chord length is 6.5 m, and the bus speed during passage is 25 km\/h;at 45 km\/h, the radius is 80 m, the chord length is 8.0 m, and the bus speed during passage is 30 km\/h;at 50 km\/h, the radius is 113 m, the chord length is 9.5 m, and the bus speed during passage is 35 km\/h.\nRelatively insignificant minor road approaches shall be provided with a speed breaker at 8 m to 12 m away from edge line (as per clause 9.2.11 of IRC:SP:73-2018).. Code: IRC:99-2018. Clause: 3.1.1.1"
  }
]